Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/nord.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Can reflect on his or her own professional praxis and adjust this under supervision
nb: kan reflektere over egen faglig utøvelse og justere denne under veiledning

source: EU H2020 Gender Net, Research Council of Norway
nb: EU H2020 Gender Net, Forskningsrådet

source: Collaboration project led by Trine Seeberg (SINTEF-Digital).
nb: Samarbeidsprosjekt ledet av Trine Seeberg (SINTEF-Digital).

source: a minimum of 30 credits administration subjects: organization, marketing, strategy and management
nb: minimum 30 studiepoeng administrasjonsfag: organisasjon, markedsføring, strategi og ledelse

source: Biological themes in the science subjects NAT1001, NAT1002,
nb: Biologiske emne i naturfaga NAT1001 og NAT1002, Utefag

source: The group has received international guests from IDERN, among others, and has presented papers internationally on the subject.
nb: Gruppen har tatt imot internasjonale gjester fra blant annet IDERN og har holdt papers internasjonalt om temaet.

source: The Project Owner and, if relevant, any partners with ownership rights to the infrastructure, is required to ensure that the research infrastructure is adequately insured and kept operational and in good working order during the contract period.
nb: Prosjektansvarlig og eventuelle samarbeidspartnere med eierskap til infrastrukturen skal sørge for at forskningsinfrastrukturen holdes forsikret, i god stand og i drift i kontraktsperioden.

source: Simulation as an educational method:
nb: Simulering som pedagogisk metode:

source: - Can use basic theories and methods in economics and agriculture.
nb: kunne bruke sentrale og aktuelle uttrykksformer og metoder innen økonomi og landbruk.

source: Exam description Due to the Covid-19 epedemic, a number of assessments and exams at Nord University has been changed.
nb: På bakgrunn av Covid-19 epidemien blir en rekke vurderinger og eksamener ved Nord universitet endret.

source: The candidate will get a solid foundation in programming, traditional art, game design, 3D game asset creation and ludology.
nb: Kandidaten får et solid grunnlag innen programmering, tradisjonell kunst, spilldesign, 3D asset creation for spill og ludology.

source: Broad categories means, for example, a region instead of specified municipalities or cities, age intervals (10–19 years, 20–29 years, etc.) rather than precise ages and the like.
nb: Med vide kategorier menes for eksempel landsdel i stedet for spesifiserte kommuner eller byer, aldersintervaller (10-19 år, 20-29 år osv.) heller enn presis alder og lignende.

source: consequences of the conflict and its consequences in Africa and Latin America.
nb: så vel som konsekvensene av konflikten og dens konsekvenser i Afrika og Latin-Amerika.

source: Each of the courses listed below offers 10 ECTS credits.
nb: Hvert av kursene i oversikten under gir 10 studiepoeng/ECTS.

source: Continue on to Settings.
nb: Og videre på Settings.

source: Will be able to write an easy Norwegian text (bokmål)
nb: Skal kunne skrive en enkel norsk tekst (bokmål)

source: The Erasmus Charter for Higher Education (ECHE) provides the general quality framework for European and international cooperation activities a higher education institution may carry out within the Programme.
nb: Erasmus Charter for Higher Education (ECHE) angir det overordnede kvalitetsrammeverket for høyere utdanningsinstitusjoners internasjonale samarbeidsaktiviteter innen Erasmus+.

source: Campus teaching, 12 weeks,
nb: Campusundervisning, 12 uker,

source: assess ethical challenges in the field of practice and adjust your own practice in relation to this
nb: vurdere etiske utfordringer i praksisfeltet og justere egen praksis i forhold til dette

source: The government has proposed an initial allocation of NOK 110 million for the "Blått bygg" project at Nord University in Bodø in the 2022 national budget.
nb: Regjeringen foreslår en startbevilgning på 110 millioner kroner til prosjektet Blått bygg ved Nord universitet i Bodø i statsbudsjettet for 2022.

source: National Theater, Trøndelag Theater and Hålogaland Theater, to name a few.
nb: Nationaltheatret, Trøndelag Teater og Hålogaland Teater, for å nevne noen.

source: What about students at risk?
nb: Hva med studenter i risikogrupper?

source: – Why is it useful for students to meet a person like Leckie?
nb: – Hvorfor er det nyttig for studentene å få treffe en person som Leckie?

source: h) can apply professional knowledge to assess and clarify reports and examine the care situation of children and young people and implement, follow up and evaluate measures when necessary for the child's health, living conditions and social development
nb: h) kan anvende faglig kunnskap for å vurdere og avklare meldinger og undersøke omsorgssituasjonen til barn og unge og iverksette, følge opp og evaluere tiltak når det er nødvendig for barnets helse, levekår og sosiale utvikling

source: Communicate what RNA molecules are, why it is important to investigate RNA, and how studies can be designed and performed
nb: Studenten skal kunne kommunisere hva RNA er, hvorfor det er viktig å undersøke RNA, og hvordan slike undersøkelser kan planlegges og utføres

source: Can identify and systematically work on skills required for performance development in sports
nb: Kunne bidra til implementering av musikkbasert miljøbehandling og holdningsskapende arbeid i tråd med etiske krav og retningslinjer

source: The research group investigates sports performance multidisciplinary from disciplines like physiology, biomechanics, motor learning and control, Science of sports coaching.
nb: Denne forskningsgruppen undersøker sportsresultater tverrfaglig fra disipliner som fysiologi, biomekanikk, motor læring og kontroll, og treningslære.

source: The main objective of the MoVeM project is to implement and evaluate a digital mentoring technology to develop and stimulate quality improvement of mentoring practices at music teacher training institutions in Norway.
nb: Hovedmålet i MoVeM-prosjektet, er å prøve ut en digital veiledningsteknologi for å utvikle og stimulere til kvalitetsheving av veiledningspraksis ved musikklærerutdanninger i Norge.

source: I have completed and received approval for the coursework component.
nb: Jeg har gjennomført og fått godkjent opplæringsdelen.

source: A normal class group is comprised of around 30 students.
nb: En vanlig klasse består av ca 30 studenter.

source: Understand the importance of food safety in the seafood industry
nb: Forstå viktigheten av god kvalitetsstyring i sjømatnæringen

source: number of credit points for managerial experience is limited to 8.
nb: Maksimalt antall poeng for ledererfaring settes til 8.

source: possesses specialized knowledge of methods, techniques, and acceptable progression to carry out and disseminate an independent empirical research project.
nb: innehar spesialisert kunnskap om fremgangsmåte, teknikker, og akseptabel progresjon for å gjennomføre og formidle et selvstendig empirisk forskningsprosjekt.

source: d) have insight into how to exercise judgment in situations with inadequate and/or conflicting information and identify the scope of opportunity within different professional and institutional contexts
nb: d) har innsikt i hvordan utvise dømmekraft i situasjoner med mangelfull og/eller motstridende informasjon og identifisere mulighetsrom innen ulike profesjonelle og institusjonelle kontekster

source: , AAM) of all articles may be made openly accessible (
nb: /Author's Accepted Manuscript, AAM) av alle artikler kan gjøres tilgjengelig (

source: For the duration of the project period, the Project Owner and partners must have the right to use, at no charge, all project results that are necessary for implementing their own work in the project.
nb: I prosjektperioden skal prosjektansvarlig og samarbeidspartnerne ha vederlagsfri bruksrett til alle prosjektresultater som er nødvendige for gjennomføringen av eget arbeid i prosjektet.

source: The 'Positive Recreation' scheme in Bodø has around 200 unique users.
nb: Det er om lag 200 unike brukere av ordninga Positiv fritid i Bodø, som tillater booking av utstyr på nettet.

source: HI117Sv1 Modern World History (after 1750) - 10 study points.
nb: HI117Sv1 Moderne verdenshistorie (etter 1750) - 10 studiepoeng.

source: The study programme is primarily organized into two sub-courses with varying emphasis in Music Production1 and Music Production 2:
nb: Studiet er i hovedsak organisert i to delemner med ulik vektlegging i Musikkproduksjon1 og Musikkproduksjon 2:

source: Each student may apply to take a semester abroad at a foreign institution.
nb: Den enkelte student kan søke om å ta et semester av studiet ved et studiested i utlandet.

source: master the working methods for functional screening and biomechanics that apply in line with ethical requirements and guidelines
nb: beherske de arbeidsformer for funksjonell screening og biomekanikk som gjelder i tråd med etiske krav og retningslinjer

source: archived in the institutional repository (see also 3.3).
nb: arkiveres i vitenarkivet (se også punkt 3.3).

source: Business Administration, One year programme
nb: Årsstudium i økonomi og ledelse

source: included as part of standard accessories.
nb: som del av standard tilbehør.

source: The student welfare organisation Studentinord facilitates onsite and online meetings for students.
nb: Studentsamskipnaden Studentinord legger til rette for flere fysiske og digitale møtesteder for studentene.

source: legal basis for processing personal data
nb: rettslig grunnlag for å behandle personopplysninger

source: Will be able to understand an easy Norwegian text (bokmål)
nb: Skal kunne forstå en enkel norsk tekst (bokmål)

source: game design and development
nb: spilldesign og -utvikling

source: Doctoral research fellows who have poor working conditions in bedsits/flats.
nb: Ph.d.-stipendiater som har dårlige arbeidsforhold i hybel/leilighet

source: When processing personal data, the following principles of the General Data Protection Regulation (GDPR) shall always be followed:
nb: Ved behandling av personopplysninger skal følgende prinsipper i personvernforordningen (GDPR) alltid følges:

source: institutional repository no later than at the time of publication.
nb: deponeres i vitenarkivet senest ved publiseringstidspunktet.

source: Has specialised knowledge of intensive medical treatment of acute and/or critically ill patients
nb: ha spesialisert innsikt i intensivmedisinsk behandling av akutt og/eller kritisk syke

source: Rector Hanne Solheim Hansen hopes that they can start work in 2022 and that the new building will be ready three years later.
nb: Rektor Hanne Solheim Hansen håper de kan sette spaden i jorda i 2022, og at Blått bygg står ferdig tre år senere.

source: The goal is to develop a research foundation for a main project focusing on the implementation of a new Sami curriculum from autumn 2020.
nb: Målet er å utvikle et forskningsmessig grunnlag for et hovedprosjekt med fokus på implementering av ny samisk læreplan fra høsten 2020.

source: Practical sessions cover humoral and cellular immune assays, computer-based transcriptome mining and synteny searches in fish genomes.
nb: Det praktiske arbeidet omhandler humorale og cellulære immunanalyser, datamaskinbasert transkriptom mining og synteny søk i fiskegenom.

source: e) be familiar with original thinking and innovation processes in social work be able to contribute to service innovation and systematic and quality-enhancing work processes
nb: e) kjenner til nytenkning og innovasjonsprosesser i sosialt arbeid, og kan bidra til tjenesteinnovasjon og systematiske og kvalitetsforbedrende arbeidsprosesser

source: - What do you think about the Studentinord scheme?
nb: - Hva synes du om tilbudet til Studentinord?- Veldig bra.

source: responding to inquiries from informants in the project about how they can safeguard their privacy rights
nb: besvare henvendelser fra informanter i prosjektet om hvordan de kan ivareta sine personvernrettigheter

source: The course combines several teaching and learning methods.
nb: Kurset kombinerer flere undervisnings- og læringsformer.

source: Eugenia Zuroski (PhD Brown) is Associate Professor of English and Cultural Studies at McMaster University.
nb: Eugenia Zuroski (PhD Brown) er førsteamanuensis i engelsk og kulturstudier ved McMaster University i Canada.

source: In most cases, you must obtain consent from your informants.
nb: I de aller fleste tilfeller må du innhente samtykke fra dine informanter.

source: Depending on the corona situation in the Nordic countries in autumn of 2021, students might be able to travel and spend one week in Bodø, one week in Gothenburg and one week in Akureyri / Holar.
nb: Avhengig av koronasituasjonen i Norden høsten 2021, vil det vurderes om det er mulig for studentene å reise en uke til Bodø, en uke til Gøteborg og en uke til Akureyri/ Holar.

source: •In advance of the meeting, organiser circulates:
nb: •Koordinator sender rundt før av møtet:

source: Grading: approved/not approved.
nb: Vurderingsuttrykk godkjent/ikke godkjent.

source: I currently teach at at the Faculty of Teacher Education and Arts.
nb: Jeg underviser i dag på ulike studier på Fakultet for lærerutdanning og kunst- og kulturfag.

source: On Nord's website under "Student" you will find the tab Office 365 (can be downloaded for free by our students).
nb: På Nords hjemmeside under «Student» finner du fanen Office 365 (kan lastes ned gratis av våre studenter).

source: Graded pass/no pass.
nb: Vurderes til bestått/ikke bestått.

source: You have a duty of confidentiality as a researcher, and in your role as an employee, you may not use/share personal data that informants have shared with you as a researcher.
nb: Du har taushetsplikt som forsker, og kan i din rolle som ansatt ikke bruke/dele personopplysninger informantene har delt med deg som forsker.

source: Sampling is for the most carried out using the research vessel "Tanteyen", a Viksund 1030.
nb: Prøvetaking utføres i stor grad ved bruk av forskningsfartøyet ”Tanteyen”, en Viksund 1030.

source: Neo-liberalism after ca. 1980
nb: nyliberalisme og «høgrebølgje» etter i 1980-åra.

source: Qualifications and are 25 years of age or older may apply for admission based on their prior learning and work experience.
nb: Søkere som ikke har generell studiekompetanse, og er 25 år eller eldre, kan søke

source: SA 218S History, Politics and Northern Resources
nb: SA 218S Historie, politikk og nordlige ressurser

source: Assessment task, comprises 0/100 of the grade, grading scale Approved - Not approved.
nb: Arbeidskrav - skriftlig/muntlig presentasjon av egen Ph.d, teller 0/100 av karakteren, karakterregel Godkjent - Ikke godkjent.

source: - PhD in Business Economics at Nord University with the title "Entrepreneurial Learning: An Exploration of the Learning of New Venture Founders" (2019).
nb: - PhD i Bedriftsøkonomi ved Nord Universitet med titel "Entrepreneurial Learning: An Exploration of the Learning of New Venture Founders" (2019).

source: The fol owing text will appear:
nb: Du får da opp følgende:

source: A tool making it easier to use Google Scholar to find full-text articles.
nb: Verktøy som gjør det enklere å bruke Google Scholar for å finne fulltekstartikler.

source: - Associate Professor Andrew Sweetman, Heriot-Watt University, Edinburgh, Scotland- Postdoctor Ingrid Wiedmann, Department of Arctic and Marine Biology, UiT - The Arctic University of Norway- Professor Leslie Noble, FBA, Nord University
nb: - Førsteamanuensis Andrew Sweetman, Heriot-Watt University, Edinburgh, Skotland- Postdoktor Ingrid Wiedmann, institutt for arktisk og marin biologi, universitetet i Tromsø, Norges arktiske universitet- Professor Leslie Noble, FBA, Nord universitet

source: Ph.d.-candidate Qirui Zhang will hold a trial lecture and defend his thesis for the degree Philosophiae Doctor (PhD), at the Faculty of Biosciences and Aquaculture, Nord University.
nb: Ph.d.-kandidat Qirui Zhang skal holde prøveforelesning og disputere for graden Philosophiae doctor (Ph.d), ved fakultet for biovitenskap og akvakultur, Nord universitet.

source: can receive feedback on how they perform their coaching role and adjust it accordingly
nb: kan motta feedback på utførelse av trenerrollen og justere denne

source: Many Open Access journals cover their costs through Article Processing Charges (APCs).
nb: Mange åpne tidsskrifter dekker kostnader gjennom publiseringsavgift (APC).

source: Compund assessment, grading scale A-E for pass, F for fail
nb: Sammensatt vurdering, karakterregel A-E, Beste A, Ikke bestått F

source: Written exam, 4 hours, comprises 100/100 of the grade, grading scale A-E for pass, F for fail.
nb: Skriftlig skoleeksamen, 4 timer, teller 100/100 av karakteren, karakterregel A-E, Beste A, Ikke bestått F.

source: Portfolio - 4 pieces of written work to be answered in groups of up to four candidates, represents 50/100 of the grade.
nb: Mappe - 4 stk skriftlige arbeider som skal besvares i grupper på inntil fire kandidater, teller 50/100 av karakteren.

source: can reflect on one’s own professional performance of training and physical activity and be able to adjust this under supervision if necessary
nb: kan reflektere over egen faglig utførelse av trening og fysisk aktivitet og eventuelt kunne justere denne under veiledning

source: colloquia, comprises 0/100 of the grade. Graded approved/not approved.
nb: på kollokviegrupper, teller 0/100 av karakteren, karakterregel Godkjent - Ikke godkjent.

source: Look for choices like ‘Open Access’, ‘Free full-text’, etc.
nb: Se etter valg som “Open Access”, “Free full-text” e.l.

source: Project work and entrepreneurship:
nb: Prosjektarbeid og entreprenørskap

source: We recommend students take an exchange in the second semester.
nb: Tredje semester egner seg best for utenlandsopphold.

source: Once the ful -text document has been uploaded to Cristin, the file is transferred to our institutional
nb: Når ful tekstdokumentet er lagret i Cristin, overføres filen til videre behandling i vitenarkivet.

source: If you are able to collect the information anonymously instead, you must do so.
nb: Kan du i stedet innhente opplysningene anonymt, så skal du gjøre det.

source: TRA1000v1 Grunnutdanning tilsyn - 10 study points.
nb: TRA1000v1 Grunnutdanning tilsyn - 10 studiepoeng. Pensumlitteratur

source: For more information, please contact:
nb: For mer informasjon, vennligst kontakt:

source: The crew has extensive experience with sampling and data collection.
nb: Mannskapet har lang erfaring med prøvetaking og innsamling av data.

source: Educational credit points:
nb: Poeng for utdanning:

source: Vocational experience credit points:
nb: Poeng for yrkespraksis:

source: – Online classes can be demanding, for both students and staff.
nb: – Digitale forelesninger er ofte krevende for både studenter og ansatte.

source: English Language and Linguistics SP170LNo special costs beyond semester fee and course literature.
nb: Engelsk språk og språkvitenskap SP170LIngen kostnader utover semesteravgift og pensumlitteratur

source: Use relevant scientific literature actively and independently
nb: bruke relevant faglitteratur aktivt og på en selvstendig måte

source: Members are encouraged to share works-in-progress and convene with an assigned respondent/critic.
nb: Medlemer i gruppa vert inviterte til å ha innlegg og får en hovudrespondent / criticus primus.

source: Masters in Disability and Society, NTNU (2011)
nb: Mastergrad i funksjonshemming og samfunn fra NTNU (2011).

source: Work requirements (AK) 2: Laboratory exercises with subsequent lab reports
nb: Arbeidskrav (AK) 2: Laboratorieøvelser med etterfølgende labrapporter

source: Portfolio, counts 50/100 of total grade. Grading scale A-F.
nb: Mappen teller 50/100 av karakteren, karakterregel A-E, Beste A, Ikke bestått F.

source: Final assessment as an individual home examination (2 weeks):
nb: Endelig vurdering som individuell hjemmeeksamen (2 uker):

source: use internal control systems, including quality assurance systems and exception management systems relevant to professional practice
nb: bruke internkontrollsystemer, inkludert kvalitetssystemer og systemer for avvikshåndtering relevant for yrkesutøvelsen

source: The student should be able to access a comprehensive amount of scientific literature, to review relevant knowledge from the literature and to
nb: Studenten skal vise evne til å sette seg inn i omfattende faglitteratur, til å formidle relevante kunnskaper fra litteraturen, og til å argumentere for

source: identify, discuss and manage current themes and issues relevant to pharmacists
nb: identifisere, drøfte og håndtere dagsaktuelle tema og problemstillinger relevant for farmasøyter

source: It is fantastic, says Dean Reid Hole, Faculty of Biosciences and Aquaculture at UiN.
nb: Det er strålende, sier dekan Reid Hole, Fakultet for biovitenskap og akvakultur ved UiN.

source: Compulsory participation in colloquia, comprises 0/100 of the grade. Graded approved/not approved.
nb: Obligatorisk deltakelse (OD) - på kollokviegrupper, teller 0/100 av karakteren, karakterregel Godkjent - Ikke godkjent.

source: Sections 11-14 of the Guidelines for Examination Candidates at Nord University
nb: retningslinjer for eksamenskandidater ved Nord universitet, punkt 11-14

source: Master of Biosciences at Nord have the following specialisations:
nb: Master i biovitenskap har følgende spesialiseringsmuligheter:

source: Mikel Dominguez Cainzos will defend his PhD degree at Nord University, Faculty of Social Sciences.
nb: Ph.d.-kandidat Mikel Dominguez Cainzos skal holde prøveforelesning og disputas for graden Philosophiae Doctor (ph.d.) ved Fakultet for samfunnsvitenskap, Nord universitet.

source: The Cold War and Decolonization will, similarly, not be focussing on the US or the Soviet Union, but discuss Asian American minorities, as well as the
nb: Den kalde krigen og avkoloniseringen vil på samme måte ikke fokusere på USA eller Sovjetunionen, men diskutere asiatisk-amerikanske minoriteter,

source: Transferrin g rights to publishers
nb: Overf øring av rettigheter til utgiver

source: Can communicate extensive independent work and masters the field¿s forms of expression in specialised nursing praxis and professional development
nb: kunne formidle et omfattende selvstendig arbeid og beherske fagområdets uttrykksformer i spesialsykepleiepraksis og fagutvikling

source: Are our students in the teacher education ready?
nb: Er studentene i vår lærerutdanning klare?

source: Meet at the specified location at least 30 minutes before the exam is scheduled to start.
nb: Oppmøte i eksamenslokalet er senest 30 minutter før eksamen.

source: All datasets added into Nord Open Research Data are granted the
nb: Alle datasett som lastes opp til Nord Open Research Data vil automatisk bli lisensiert med

source: The Data Protection Officer at Nord can assist in the assessment.
nb: Personvernombudet ved Nord kan bistå i vurderingen.

source: The first joint conference on global change was organised by the universities in Košice, Slovakia in 2017 with the financial support from Iceland, Liechtenstein and Norway through the EEA and Norway Grants.
nb: Den første samarbeidskonferansen om global endring ble arrangert i Košice, Slovakia i 2017 med økonomisk støtte fra Island, Liechtenstein og Norge gjennom EØS og Norway Grants.

source: Check Canvas for more information.
nb: Følg med i Canvas for mer informasjon.
